Autodesk.Revit.DB.IParamDefExternalButtonValueProviderProxy.ShouldBeListed(Autodesk.Revit.DB.Document)
this is temp interface method for 2025.0 release to hide the substitution parameter from later point releases saved model with the substitution data
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProviderProxy.GetProviderName
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProviderProxy.GetProviderId
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProviderProxy.GetParameterName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProviderProxy.GetStringRepresentation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Since:
2025